Repository: GamemakerChina/GmlSpec-CN
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: With this function you can set the mask_index of a specific object (for more information on masks see The Object Editor).
zh_cn: 使用此函数，您可以设置特定对象的mask_index(有关掩码的更多信息，请参阅对象编辑器)。

source: With this function you can set the maximum level of anisotropy when using the tf_anisotropic filter mode (see gpu_get_tex_mip_filter() for more information) on a shader sampler.
zh_cn: 使用此函数，可以在着色器采样器上使用tf_anisotropic过滤器模式时设置最大各向异性级别(有关详细信息，请参见gpu_get_tex_mip_filter())。

source: With this function you can set the minimum mipmap level which is currently used for a given shader sampler.
zh_cn: 使用此函数，您可以设置当前用于给定着色器采样器的最小mipmap级别。

source: With this function you can set the minimum mipmap level which is currently used, where a value of 0 is the highest resolution, 1 is to use the first mipmap, 2 is the second etc...
zh_cn: 通过此函数，您可以设置当前使用的最小中见大贴图级别，其中值0表示最高分辨率，1表示使用第一个中见大贴图，2表示第二个，依此类推...

source: With this function you can set the mip filter mode for a given shader sampler.
zh_cn: 使用此函数，您可以为给定的着色器采样器设置mip过滤器模式。

source: With this function you can set the mipmap bias value for a given shader sampler.
zh_cn: 通过此函数，你可以为给定的着色采样器设置mipmap偏置值。

source: With this function you can set the mipmap bias value, where a value of 0 equals no bias, 1 equals the first mipmap, 2 equals the second mipmap etc...
zh_cn: 通过此函数，您可以设置多纹理贴图偏移值，其中值0等于无偏移，1等于第一个多纹理贴图，2等于第二个多纹理贴图，依此类推...

source: With this function you can set the mix of red, green and blue colours for all particles created of the given type.
zh_cn: 通过此函数，您可以为给定类型的所有粒子设置红、绿、蓝颜色的混合。

source: With this function you can set the persistence of a specific object.
zh_cn: 通过此函数，您可以设置特定对象的持久性。

source: With this function you can set the playhead position of a sequence element to a specific frame.
zh_cn: 使用此函数，您可以设置序列元素的播放头位置到特定帧。

source: With this function you can set the position along the X (horizontal) axis of the room for the given sequence element.
zh_cn: 通过此函数，您可以为给定的序列元素设置沿房间X(水平)轴的位置。

source: With this function you can set the position along the Y (vertical) axis of the room for the given sequence element.
zh_cn: 通过此函数，您可以设置给定序列元素沿房间的Y(垂直)轴的位置。

source: With this function you can set the position of the game window within the browser (HTML5) or display (Windows, Ubuntu (Linux) or macOS) and set the scale of the window too.
zh_cn: 通过此函数，您可以在浏览器(HTML5)或显示器(Windows、Ubuntu (Linux)或macOS)中设置游戏窗口的位置，还可以设置窗口的比例。

source: With this function you can set the properties of the collision mask that a sprite should have.
zh_cn: 使用此函数，你可以设置一个精灵应该拥有的碰撞遮罩的属性。

source: With this function you can set the radius (in pixels) for the particles in a physics simulation.
zh_cn: 通过此函数，您可以设置物理模拟中粒子的半径(以像素为单位)。

source: With this function you can set the sprite index of a specific object.
zh_cn: 通过此函数，你可以设置特定对象的精灵索引。

source: With this function you can set the sprite shape to use for the particle type, with the following constants being acceptable:
zh_cn: 使用此函数，您可以设置用于粒子类型的精灵形状，以下常量是可接受的:

source: With this function you can set the timeout for reading and writing data to/from a server through the given socket.
zh_cn: 通过此函数，您可以设置通过给定套接字向服务器读写数据的超时时间。

source: With this function you can set the value (or values) of a shader constant to the current transform matrix (as set using the Matrix Functions).
zh_cn: 使用此函数，你可以设置一个着色器常量的值(或多个值)为当前变换矩阵(使用矩阵函数设置)。

source: With this function you can set the value (or values) of a shader constant.
zh_cn: 使用此函数，你可以设置一个着色器常量的值。

source: With this function you can set the value of a given global variable.
zh_cn: 通过此函数，您可以设置给定全局变量的值。

source: With this function you can set the value of a given variable in a struct.
zh_cn: 使用此函数，您可以在结构中设置给定变量的值。

source: With this function you can set the value of a given variable in an instance.
zh_cn: 通过此函数，您可以在实例中设置给定变量的值。

source: With this function you can set the value of a key within a given DS map.
zh_cn: 通过此函数，您可以在给定的DS map中设置键的值。

source: With this function you can set the value of an index in an array to a value.
zh_cn: 使用此函数，您可以将数组中的索引值设置为某个值。

source: With this function you can set the vibration of the gamepad motors, with either motor using a value from 0 (no vibration) to 1 (full vibration).
zh_cn: 通过此函数，您可以设置游戏手柄马达的振动，任一马达使用从0(无振动)到1(完全振动)的值。

source: With this function you can set the view port properties for any room in your game except the current one.
zh_cn: 通过此函数，您可以为游戏中除当前房间之外的任何房间设置视口属性。

source: With this function you can set the way in which particles are drawn when created on the screen.
zh_cn: 通过此函数，您可以设置在屏幕上创建粒子时绘制粒子的方式。

source: With this function you can set values of a shader constant from a buffer.
zh_cn: 使用此函数，您可以设置使用缓冲区的着色器常量的值。

source: With this function you can set whether mipmapping is switched off, switched on for everything or switched on only for texture groups selected in the Texture Group Manager on a shader sampler.
zh_cn: 通过此函数，您可以设置 mipmapping 是否关闭、打开所有内容或仅打开着色器采样器上纹理组管理器中选择的纹理组。

source: With this function you can set whether the browser window should capture all input (set it to false) or whether the game should capture the input (set it to true).
zh_cn: 通过此函数，你可以设置浏览器窗口是否应该捕获所有输入(设为false)或游戏是否应该捕获输入(设为true)。

source: With this function you can shift a path along the horizontal and vertical axis.
zh_cn: 通过此函数，您可以沿水平轴和垂直轴移动路径。

source: With this function you can show, or suppress, the various different "toast" pop-up notifications relating to challenges.
zh_cn: 通过此函数，你可以显示或抑制与挑战相关的各种不同的"toast"弹出通知。

source: With this function you can shuffle a list, which will re-order all the component values into random positions from those in which they were originally added to the list.
zh_cn: 通过此函数，您可以打乱列表，这将把所有组件值从它们最初添加到列表的位置重新排序到随机位置。

source: With this function you can shuffle an array (or subsection) in place, nothing is returned
zh_cn: 使用此函数可以将数组(或子部分)置乱到位，不会返回任何内容

source: With this function you can shuffle an array (or subsection), a new array is returned that is a copy of the original with the entries shuffled.
zh_cn: 使用此函数，您可以对数组(或子部分)进行置乱，返回一个新的数组，该数组是原始数组的副本，其中的条目被置乱。

source: With this function you can simulate the press of any key on the keyboard.
zh_cn: 通过此函数，您可以模拟键盘上任何键的按下。

source: With this function you can simulate the release of any key on the keyboard.
zh_cn: 使用此函数，您可以模拟键盘上任何键的释放。

source: With this function you can skip the remainder of the current line from a given opened text file and move to the start of the next one.
zh_cn: 使用此函数，您可以跳过给定打开文本文件的当前行其余部分，并移动到下一个文本文件的开头。

source: With this function you can sort all the values within a list, either in ascending or descending order.
zh_cn: 通过此函数，可以对列表中的所有值进行升序或降序排序。

source: With this function you can sort an array in ascending order or descending order or using a custom function to define the sort order.
zh_cn: 使用此函数，可以按升序或降序对数组进行排序，也可以使用自定义函数定义排序顺序。

source: With this function you can specify a region of the grid in which to multiply each cell value by a given amount.
zh_cn: 通过此函数，您可以指定网格的一个区域，其中每个单元格的值乘以给定的数量。

source: With this function you can start playing a previously created sync group.
zh_cn: 通过此函数，您可以开始播放之前创建的同步组。

source: With this function you can start the playback of the given sequence.
zh_cn: 通过此函数，你可以开始播放给定的序列。

source: With this function you can switch on or off the colour channels and the alpha channel for all further drawing.
zh_cn: 通过此函数，你可以打开或关闭颜色通道和alpha通道进行进一步的绘图。

source: With this function you can take two colours and then merge them together to make a new colour.
zh_cn: 通过此函数，您可以选择两种颜色，然后将它们合并成一种新的颜色。

source: With this function you can tell GameMaker to activate all instances that have been previously deactivated in a room.
zh_cn: 通过此函数，你可以告诉GameMaker去激活房间中之前被停用的所有实例。

source: With this function you can tell an instance to move in a direction, resolving collisions on the way and specify a direction in which the instance will attempt to move to get past obstacles, thus allowing traversal of slopes or small steps.
zh_cn: 使用此函数，您可以告知实例向某个方向移动，解决途中的碰撞，并指定实例将尝试移动以通过障碍物的方向，从而允许穿越斜坡或小步。

source: With this function you can tell an instance to move out of a collision in any direction and any number of pixels each step, with a value of -1 or 0 for the maxdist being a default 1000px, ie: GameMaker will move the instance continually up 1000 pixels until it is out of collision.
zh_cn: 使用此函数，你可以告诉一个实例在任何方向和任何数量的像素每步移出碰撞，maxdist的值为-1或0，默认为1000像素，即:GameMaker会将实例连续向上移动1000像素，直到它移出碰撞。

source: With this function you can tell an instance to move out of a collision with any instance flagged as solid in any direction and any number of pixels each step, with a value of -1 or 0 for the maxdist being a default 1000px, ie: GameMaker will move the instance continually up 1000 pixels until it is out of collision.
zh_cn: 使用此函数，你可以告诉一个实例在任何方向上以任何数量的像素从任何标记为实体的实例中脱离碰撞，maxdist的值为-1或0，默认为1000像素，即:GameMaker会将实例连续向上移动1000像素，直到脱离碰撞。

source: With this function you can toggle the visibility of a layer. You supply the layer ID (which you get when you create the layer using layer_create()) or the layer name (as a string - this will have a performance impact) as well as the toggle value for the layer where visible is true and invisible is false.
zh_cn: 使用此函数，你可以切换一个图层的可见性。你提供层ID(当你使用layer_create()创建层时得到)或层名(作为字符串-这将有性能影响)，以及层的切换值，其中可见为真，不可见为假。

source: With this function you can traverse the array/range performing a cumulative operation on its elements.
zh_cn: 使用此函数，您可以遍历数组/范围，对其元素执行累积操作。

source: With this function you can trigger the garbage collector, forcing it to run at the end of the current frame (step).
zh_cn: 通过此函数，您可以触发垃圾收集器，强制它在当前帧(步骤)的末尾运行。

source: With this function you can turn any value into a string.
zh_cn: 使用这个函数，您可以将任何值转换为字符串。

source: With this function you can turn on or off the power saving features of the device.
zh_cn: 通过此函数，您可以打开或关闭设备的节能功能。

source: With this function you can unload all pages in the specified texture group.
zh_cn: 通过此函数，你可以卸载指定纹理组中的所有页面。

source: With this function you can use a "sprite strip" (the sprite itself must be a sprite asset from the Asset Browser, or a sprite you have added to the game resources using sprite_add) to create a new font asset, where each sub-image would be an individual symbol or letter.
zh_cn: 通过此函数，您可以使用"精灵条"(精灵本身必须是来自资源浏览器的精灵资源，或者是您使用sprite_add添加到游戏资源中的精灵)来创建新的字体资源，其中每个子图像都是一个单独的符号或字母。

source: With this function you can use a "sprite strip" to create a new font asset, where each sub-image would be an individual symbol or letter.
zh_cn: 通过此函数，你可以使用一个"精灵条"来创建一个新的字体资源，其中每个子图像将是一个单独的符号或字母。

source: With this function you can use a "sprite strip" to replace a previously created sprite font asset, where each sub-image would be an individual symbol or letter.
zh_cn: 通过此函数，你可以使用"精灵条"来取代之前创建的精灵字体资源，其中每个子图像将是一个单独的符号或字母。

source: With this function you can write a new line to an opened text file.
zh_cn: 使用此函数，您可以向打开的文本文件写入新行。

source: With this function you can write a number to the previously opened text file.
zh_cn: 通过此函数，您可以向之前打开的文本文件写入一个数字。

source: With this function you can write a string to a previously opened text file.
zh_cn: 通过此函数，您可以将字符串写入先前打开的文本文件。

source: With this function you can write information from a buffer to a given surface.
zh_cn: 使用此函数，您可以将信息从缓冲区写入给定的表面。

source: With this function you can write information from a surface to a given buffer.
zh_cn: 使用此函数，您可以将信息从表面写入给定的缓冲区。

source: With this function you end the building of the custom primitive.
zh_cn: 使用此函数，您可以结束自定义图元的构建。

source: With this function you reset all further drawing from the target surface back to the screen.
zh_cn: 通过此函数，你重置所有从目标表面的进一步绘图回到屏幕上。

source: With this function you retrieve the type of buffer that is being referenced by a buffer ID value.
zh_cn: 通过此函数，您可以检索缓冲区ID值所引用的缓冲区类型。

source: With this function you set all further drawing to the target surface rather than the screen and in this way you can tell GameMaker to only draw specific things to the specified surface.
zh_cn: 通过此函数，你可以将所有进一步的绘图设置到目标表面而不是屏幕上，通过这种方式，你可以告诉GameMaker只在指定的表面上绘制特定的东西。

source: With this function you supply the sequence element ID - as returned by layer_sequence_create() or by one of the layer element functions - and it will check if the sequence is currently paused or not, returning true if it is paused, and false if it is not.
zh_cn: 通过此函数，您提供序列元素ID -由layer_sequence_create()或由一个层元素函数返回-它将检查序列当前是否暂停，如果暂停则返回true，如果没有返回false。

source: With this function you supply the sequence element ID - as returned by layer_sequence_create() or by one of the layer element functions - and it will check if the sequence is finished playing or not, returning true if it is, and false if it is not.
zh_cn: 通过此函数，您提供序列元素ID—由layer_sequence_create()或由一个层元素函数返回—它将检查序列是否播放完毕，如果是则返回true，如果不是则返回false。

source: With this function you supply the sequence element ID - as returned by layer_sequence_create() or by one of the layer element functions - and it will return the current X position in the game room for the sequence.
zh_cn: 通过此函数，你提供了序列元素ID——由layer_sequence_create()或层元素函数之一返回——它将返回序列在游戏空间中的当前X位置。

source: With this function you supply the sequence element ID - as returned by layer_sequence_create() or by one of the layer element functions - and it will return the current Y position in the game room for the sequence.
zh_cn: 通过此函数，你提供了序列元素ID——由layer_sequence_create()或层元素函数之一返回——它将返回序列在游戏空间中的当前Y位置。

source: With this function you supply the sequence element ID - as returned by layer_sequence_create() or by one of the layer element functions - and it will return the current angle of the sequence element in the game room.
zh_cn: 通过此函数，您提供序列元素ID—由layer_sequence_create()或由一个层元素函数返回—它将返回游戏房间中序列元素的当前角度。

source: With this function you supply the sequence element ID - as returned by layer_sequence_create() or by one of the layer element functions - and it will return the current playback speed scale.
zh_cn: 使用此函数，您可以提供序列元素ID——由layer_sequence_create()或层元素函数之一返回——它将返回当前回放速度比例。

source: With this function you supply the sequence element ID - as returned by layer_sequence_create() or by one of the layer element functions - and it will return the current playhead direction, which will be one of the constants listed below.
zh_cn: 通过此函数，您提供序列元素ID—由layer_sequence_create()或由一个层元素函数返回—它将返回当前播放头方向，这将是下面列出的常量之一。

source: With this function you supply the sequence element ID - as returned by layer_sequence_create() or by one of the layer element functions - and it will return the current playhead position (the current frame the playhead is on).
zh_cn: 通过此函数，您提供序列元素ID -由layer_sequence_create()或由一个层元素函数返回-它将返回当前播放头位置(播放头所在的当前帧)。

source: With this function you supply the sequence element ID - as returned by layer_sequence_create() or by one of the layer element functions - and it will return the current scale along the X axis of the sequence element in the game room.
zh_cn: 使用此函数，您可以提供序列元素ID——由layer_sequence_create()或层元素函数之一返回——它将返回游戏房间中序列元素沿X轴的当前比例。

source: With this function you supply the sequence element ID - as returned by layer_sequence_create() or by one of the layer element functions - and it will return the current scale along the Y axis of the sequence element in the game room.
zh_cn: 使用此函数，您可以提供序列元素ID——由layer_sequence_create()或层元素函数之一返回——它将返回游戏房间中序列元素的Y轴上的当前比例。

source: With this function you supply the sequence element ID - as returned by layer_sequence_create() or by one of the layer element functions - and it will return the length of the sequence.
zh_cn: 通过此函数，您提供序列元素ID—由layer_sequence_create()或由一个层元素函数返回—它将返回序列的长度。

source: With this function you supply the sequence element ID - as returned by layer_sequence_create() or by one of the layer element functions - and it will return the sequence instance struct.
zh_cn: 通过此函数，您提供序列元素ID—由layer_sequence_create()或由一个层元素函数返回—它将返回序列实例结构。

source: With this function you supply the sequence element ID - as returned by layer_sequence_create() or by one of the layer element functions - and it will return the sequence object struct.
zh_cn: 使用此函数，您可以提供序列元素ID——由layer_sequence_create()或层元素函数之一返回——它将返回序列对象结构。

source: With this function you tell an instance to take a "step" towards a specific point, specified by the xgoal and ygoal values.
zh_cn: 使用此函数，您可以告诉一个实例向一个特定的点"前进"，这个点由xgoal和ygoal值指定。

source: With this function you tell the instance to run the actions or code that has been placed within one of the 16 user defined events.
zh_cn: 使用此函数，您可以告诉实例运行已经放置在16个用户定义的事件之一中的动作或代码。

source: With this function you would get a return string of "81".
zh_cn: 使用此函数，您将得到一个返回字符串"81"。

source: With this function, you can connect to the specified URL in order to retrieve information in the form of a file.
zh_cn: 通过此函数，您可以连接到指定的URL，以便以文件的形式检索信息。

source: With this function, you can create an HTTP header request to define the operating parameters of an HTTP transaction, which can be used for many things like (for example) authentication via HTTP headers if you use RESTful APIs.
zh_cn: 通过此函数，您可以创建一个HTTP报头请求来定义HTTP事务的操作参数，如果使用RESTful api，可以将其用于许多事情，比如通过HTTP报头进行身份验证(例如)。

source: With this function, you can toggle on (true) or off (false) drawing the collision data for the current skeletal animation sprite being used by the instance.
zh_cn: 使用此函数，可以打开(true)或关闭(false)绘制实例正在使用的当前骨骼动画精灵的碰撞数据。

source: With this function, you connect to the specified URL in order to retrieve information.
zh_cn: 使用此函数，您可以连接到指定的URL以检索信息。

source: With this read only variable you can get a count of all active instances that are in the room.
zh_cn: 使用这个只读变量，您可以获得房间中所有活动实例的计数。

source: With this variable you can get the keycode of the key that is currently being pressed and it will return 0 if no key is being pressed when the check is done.
zh_cn: 用这个变量你可以得到当前被按下的键的键码，如果检查完成后没有键被按下，它将返回0。

source: With this variable you can set the contents of a given view port to draw to a surface, or get the current surface id if one has been assigned to a view port.
zh_cn: 使用此变量，您可以将给定视口的内容设置为绘制到表面，或者获取当前的表面id(如果已将一个id分配给视口)。

source: With this variable you can set the contents of a view port to draw to a surface.
zh_cn: 通过这个变量，您可以设置视图端口的内容以绘制到一个表面上。

source: Working_directory can actually return two different values depending on what you are using it for.
zh_cn: Working_directory实际上可以返回两个不同的值，这取决于您使用它的目的。

source: You also need to supply the number of samples in the buffer and the channels that the sound requires.
zh_cn: 您还需要提供缓冲区中的样本数量和声音所需的通道。

source: You are also able to use a format string with "{x}" placeholders (i.e. {0},{1},...) where 'X' is the argument number after the format string (starting at 0).
zh_cn: 您还可以使用带有"{x}"占位符的格式字符串(例如{0},{1},...)，其中 'X' 是格式字符串后面的参数号(从0开始)。

source: You are required to supply the sync group ID as returned by the function audio_create_sync_group().
zh_cn: 您需要提供函数audio_create_sync_group()返回的同步组ID。

source: You assign a buffer to write the primitive to, and the vertex format to use (previously defined using the vertex format functions).
zh_cn: 您分配一个缓冲区来写入图元，并指定要使用的顶点格式(以前使用顶点格式函数定义)。

source: You call this function whenever you wish to destroy an instance, normally triggering a Destroy Event and also a Clean Up Event.
zh_cn: 您可以在希望销毁实例时调用此函数，通常会触发一个销毁事件(destroy Event)和一个清理事件(Clean Up Event)。

source: You can add up the following constants to see the type of files you want (if you do not wish to add any attributes, use 0):
zh_cn: 您可以添加以下常量来查看所需的文件类型(如果您不想添加任何属性，请使用0):

source: You can add up the following constants to see the type of files you want:
zh_cn: 您可以添加以下常量来查看所需的文件类型:

source: You can also avoid this by using the file_text_readln() function along with the file_text_eof() function to loop through the contents of the file until you get to the end and then start writing.
zh_cn: 您还可以通过使用file_text_readln()函数和file_text_eof()函数来避免这种情况，它们循环遍历文件的内容，直到到达末尾，然后开始写入。

source: You can also colour the particles "on the fly" as they are created with this function, and this colour will over-ride the predefined colour of the particle, but it does not blend this colour over the particles lifetime.
zh_cn: 您还可以在通过此函数创建粒子时"动态地"为粒子着色，并且此颜色将覆盖粒子的预定义颜色，但它不会在粒子生命周期内混合此颜色。

source: You can also give an object_index (ie: the name of the object in the Asset Browser) and the function will check if any instances of that object are on the given layer.
zh_cn: 您还可以给定一个object_index(即:资源浏览器中对象的名称),此函数将检查该对象的任何实例是否在给定的层上。

source: You can also select either horizontal/vertical movement only, or allow full diagonal movements by specifying true in the allowdiag argument.
zh_cn: 您也可以选择仅水平/垂直移动，或者通过在allowdiag参数中指定true来允许全对角线移动。

source: You can also select to choose a random sub-image so that if the sprite is not animated, a different image will be chosen at random to create the sprite, or if the particle is animated it will start the animation at a random point.
zh_cn: 也可以选择随机子图像，这样，如果精灵没有设置动画，将随机选择不同的图像来创建精灵，或者如果粒子设置了动画，它将在随机点开始动画。

source: You can also set a value for the alpha of the sprite to draw it with transparency.
zh_cn: 您也可以设置精灵的透明度(Alpha)值，以透明方式绘制精灵。

source: You can also set an axis vector, which is the imaginary line along which the joint will act as a "spring" permitting the wheel to bounce up and down along it as it encounters obstacles (much like the piston joint).
zh_cn: 您也可以设置一个轴向量，它是一条假想的线，关节将沿着这条线充当"弹簧"，允许轮子在遇到障碍物时沿着它上下弹跳(很像活塞关节)。

source: You can also set this variable to effectively turn "on" or "off" a view by setting the value to true (visible) or false (invisible).
zh_cn: 您还可以通过将该值设置为true(可见)或false(不可见)来设置该变量，以有效地"打开"或"关闭"视图。

source: You can also set this variable to either true or false to start and stop the time line at any time.
zh_cn: 您还可以将此变量设置为true或false，以便在任何时间开始和停止时间线。

source: You can also specify whether the game should be aborted after the error, however please note that this only exists for compatibility reasons and showing errors will require the game to be aborted regardless of the value specified in this argument.
zh_cn: 您也可以指定游戏是否应该在错误发生后中止，但是注意，这只是出于兼容性的原因，显示错误将要求游戏中止，而不管该参数中指定的值。

source: You can also supply a quantization value, which is an integer between 0 and 3, where 0 is full quantization and 3 is zero quantization (lower values will have a subsequent degradation in quality, but create a smaller GIF).
zh_cn: 您还可以提供一个量化值，该值是一个介于0和3之间的整数，其中0表示完全量化，3表示零量化(较低的值会导致质量下降，但会创建较小的GIF)。

source: You can also supply an optional "name" argument, which will enable you to give the layer a specific name (as a string), and instead of using the layer ID to access the layer, you can use this name string instead, although it should be noted that using name strings will have a greater impact on performance than using just the ID value.
zh_cn: 您还可以提供一个可选的"名称"参数，这将使您能够为图层指定一个特定的名称(作为字符串)，并且您可以使用此名称字符串而不是使用图层ID来访问图层，但是应该注意，使用名称字符串比仅使用ID值对性能的影响更大。

source: You can also supply this to functions like animcurve_get() to later get the data from the curve.
zh_cn: 您还可以将此提供给animcurve_get()等函数，以便稍后从曲线中获取数据。

source: You can also tell it to use precise collision checking when enabled, but be aware that this requires all instances to have precise masks enabled and will greatly slow down your game when many instances are involved due to the amount of processing that has to be done.
zh_cn: 你也可以告诉它在启用时使用精确的碰撞检查，但是注意，这需要所有的实例都启用精确的遮罩，并且当涉及到许多实例时，会由于必须完成的处理量而大大降低游戏速度。

source: You can also use real numbers and not integers in this function like this - random(0.5), which will return a value between 0 and 0.4999999.
zh_cn: 您还可以在此函数中使用实数而不是整数，例如random(0.5)，它将返回0到0.4999999之间的值。

source: You can also use the keyword all to iterate through all the instances in a room, as well as a parent object to iterate through all the instances that are part of that parent / child hierarchy, and you can even specify an instance (if you have its id) as a check to see if it actually exists in the current room.
zh_cn: 还可以使用关键字all遍历房间中的所有实例，也可以使用父对象遍历父/子层次结构中的所有实例，甚至可以指定一个实例(如果有它的id)作为检查，以查看它是否实际存在于当前房间中。
